{
    "dvds": [
        {
            "title": "Inception (Blu-ray)",
            "creators": "Christopher Nolan",
            "ean_isbn13": "883929270675",
            "upc_isbn10": "883929106646",
            "description": "Acclaimed filmmaker Christopher Nolan directs an international cast in this sci-fi actioner that travels around the globe and into the world of dreams. Dom Cobb (Leonardo DiCaprio) is the best there is at extraction: stealing valuable secrets inside the subconscious during the mind’s vulnerable dream state. His skill has made him a coveted player in industrial espionage but also has made him a fugitive and cost him dearly. Now he may get a second chance if he can do the impossible: inception, planting an idea rather than stealing one. If they succeed, Cobb and his team could pull off the perfect crime. But no planning or expertise can prepare them for a dangerous enemy that seems to predict their every move. An enemy only Cobb could have seen coming.",
            "publish_date": "2010",
            "added": "2025-05-01"
        },
        {
            "title": "300",
            "creators": "",
            "ean_isbn13": "85391161035",
            "upc_isbn10": "085391161035",
            "description": "",
            "publish_date": "",
            "added": "2025-05-01"
        },
        {
            "title": "(500) Days of Summer [Blu-ray]",
            "creators": "Marc Webb",
            "ean_isbn13": "24543634737",
            "upc_isbn10": "024543634737",
            "description": "20th Century (500) Days Of Summer (Blu-ray)This is a story of boy meets girl, begins the wry, probing narrator of \"500 Days Of Summer\", and with that the film takes off at breakneck speed into a year-and-a-half of one young man's no-holds-barred love affair. Tom (Joseph Gordon-Levitt), the boy, still believes, even in this cynical mordern world, in the the notion of transforming, cosmically destined, lightning-strikes-once kind of love. Summer (Zooey Deschanel), the girl, doesn't. Not at all. But that doesn't stop Tom from going after her, again and again, like a modern Don Quixote, with all his might and courage. Suddenly, Tom is in love not just with a lovely, witty, intelligent woman - not that heminds any of that - but with the very idea of Summer, the very idea of a love that still has the power to shock the heart and stop the world.",
            "publish_date": "2015",
            "added": "2025-05-01"
        },
        {
            "title": "The Revenant [Blu-ray]",
            "creators": "Alejandro G. Iñárritu",
            "ean_isbn13": "24543119197",
            "upc_isbn10": "024543119197",
            "description": "The Revenant follows the story of legendary explorer Hugh Glass (DiCaprio) on his quest for survival and justice. After a brutal bear attack, Glass is left for dead by a treacherous member of his hunting team (Tom Hardy). Against extraordinary odds, and enduring unimaginable grief, Glass battles a relentless winter in uncharted terrain. This boldly original (Calvin Wilson, ST. LOUIS POST-DISPATCH) epic adventure captures the extraordinary power of the human spirit in an immersive and visceral experience unlike anything you have ever seen",
            "publish_date": "2016",
            "added": "2025-05-01"
        },
        {
            "title": "Inglourious Basterds (Blu-ray + Digital Copy)",
            "creators": "",
            "ean_isbn13": "25192015397",
            "upc_isbn10": "025192015397",
            "description": "Brad Pitt takes no prisoners in Quentin Tarantino’s high-octane WWII revenge fantasy Inglourious Basterds. As war rages in Europe, a Nazi-scalping squad of American soldiers, known to their enemy as “The Basterds,” is on a daring mission to take down the leaders of the Third Reich. Bursting with “action, hair-trigger suspense and a machine-gun spray of killer dialogue” (Peter Travers, Rolling Stone), Inglourious Basterds is “another Tarantino masterpiece” (Jake Hamilton, CBS-TV)!",
            "publish_date": "2009",
            "added": "2025-05-01"
        },
        {
            "title": "Julie & Julia",
            "creators": "Nora Ephron",
            "ean_isbn13": "43396292291",
            "upc_isbn10": "043396292291",
            "description": "A culinary legend provides a frustrated office worker with a new recipe for life in Julie &amp; Julia, the true stories of how Julia Child's (Meryl Streep) life and cookbook inspired fledgling writer Julie Powell (Amy Adams) to whip up 524 recipes in 365 days and introduce a new generation to the magic of French cooking. Stanley Tucci (The Devil Wears Prada) co-stars in director Nora Ephron's delicious comedy about joy, obsession and butter. Bon appétit!",
            "publish_date": "2009",
            "added": "2025-05-01"
        },
        {
            "title": "Rocky",
            "creators": "John G. Avildsen",
            "ean_isbn13": "27616915139",
            "upc_isbn10": "027616915139",
            "description": "Nominated* for 10 Academy Awards&Acirc;(r) and winner for Best Picture, it&#039;s the film that inspired a nation! Audiences and critics alike cheered this American success story of an &quot;everyman&quot; triumphing over all odds. Featuring a dynamic musical score, a thrilling fight sequence and four Oscar&Acirc;(r) - nominated* performances, this rousing crowd-pleaser will send spirits soaring. Fighting for love, glory and self-respect, Rocky&Acirc;(r) scores an exultant knockout!  Rocky Balboa (Sylvester Stallone) is a Philadelphia club fighter who seems to be going nowhere. But whena stroke of fate puts him in the ring with a world heavyweight champion, Rocky knows that it&#039;s his one shot at the big time - a once-in-a-lifetime opportunity to go the distance and come out a winner!  *1976: Actor (Stallone), Actress (Talia Shire), Supporting Actor (Burgess Meredith, Burt Young), Director (won), Original Screenplay, Original Song, Editing (won), Sound",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Juno (Single-Disc Edition)",
            "creators": "Jason Reitman",
            "ean_isbn13": "24543506874",
            "upc_isbn10": "024543506874",
            "description": "Juno MacGuff (Ellen Page) is a cool, confident teenager who takes a nine-month detour into adulthood when she's faced with an unplanned pregnancy-and sets out to find the perfect parents for her baby. With the help of her charmingly unassuming boyfriend (Michael Cera), supportive dad (J.K Simmons) and no-nonsense stepmom (Allison Janney), Juno sets her sights on an affluent couple (Jennifer Garner and Jason Bateman) longing to adopt their first child.",
            "publish_date": "2008",
            "added": "2025-05-01"
        },
        {
            "title": "The Truman Show (Special Collector's Edition)",
            "creators": "Peter Weir",
            "ean_isbn13": "9781415713136",
            "upc_isbn10": "097360309140",
            "description": "An insurance salesman, Truman Burbank (Carrey), begins to doubt reality when he realizes that his life is a TV program.",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Love Actually (Widescreen Edition)",
            "creators": "",
            "ean_isbn13": "9780783284309",
            "upc_isbn10": "025192329326",
            "description": "\"Get ready for fun!\" (Leah Rozen, People) with the \"feel good movie of the year!\" (Clay Smith, Access Hollywood) Love Actually is the ultimate romantic comedy from the makers of Bridget Jones's Diary and Notting Hill. Funny, irresistible and heartwarming, an all-star cast (Hugh Grant, Liam Neeson, Colin Firth and Emma Thompson, to name a few!) will take you on a breathtaking tour of love's delightful twists and turns. Fall under the spell of Love Actually and share the laughs and charm again and again.",
            "publish_date": "2004",
            "added": "2025-05-01"
        },
        {
            "title": "Hitch (Widescreen Edition)",
            "creators": "Andy Tennant",
            "ean_isbn13": "9781404983960",
            "upc_isbn10": "043396112353",
            "description": "Meet Hitch (Will Smith), New York City's greatest matchmaker.  Love is his job and he'll get you the girl of your dreams in just three easy dates, guaranteed! And that's exactly what happens when Albert Brennaman (TV's Kevin James, \"The King of Queens\") wins the heart of gorgeous society heiress Allegra Cole (supermodel Amber Valletta).  So when tabloid columnist Sara Melas (Eva Mendes, Stuck On You, Once Upon a Time in Mexico) decides to uncover the secret behind the tubby schlub's success, she's shocked to discover that Alex Hitchens, the charming young man she's been seeing, is the legendary date doctor himself.  Exposed in a front-page scoop, it's now up to Alex to try to save Albert and Allegra's relationship as well as his own.  Which only goes to show that just when you think you've found true love, there's always a HITCH.",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Crank (Widescreen Edition)",
            "creators": "Brian Taylor, Mark Neveldine",
            "ean_isbn13": "31398206927",
            "upc_isbn10": "031398206927",
            "description": "There are a thousand ways to raise your adrenaline, and today hit many Chev Chelios (Jason Statham) will need every one! He has one hour to settle the score and say good-bye to his girl and go out with a little style! The only question is, will he stay alive long enough to see it happen?",
            "publish_date": "2007",
            "added": "2025-05-01"
        },
        {
            "title": "Brokeback Mountain (Full Screen Edition)",
            "creators": "Ang Lee",
            "ean_isbn13": "25192631627",
            "upc_isbn10": "025192631627",
            "description": "Brokeback Mountain is a sweeping epic that explores the lives of two young men, a ranch hand and a rodeo cowboy, who meet in the summer of 1963 and unexpectedly forge a lifelong connection. The complications, joys and heartbreak they experience provide a testament to the endurance and power of love. Heath Ledger and Jake Gyllenhaal deliver emotionally charged, remarkably moving performances in \"a movie that is destined to become one of the great classics of our time\" (Clay Smith, The Insider).",
            "publish_date": "2006",
            "added": "2025-05-01"
        },
        {
            "title": "What Women Want  (Widescreen)",
            "creators": "",
            "ean_isbn13": "97363383826",
            "upc_isbn10": "097363383826",
            "description": "DVD",
            "publish_date": "2001",
            "added": "2025-05-01"
        },
        {
            "title": "The Prestige",
            "creators": "Christopher Nolan",
            "ean_isbn13": "786936705157",
            "upc_isbn10": "786936705157",
            "description": "Award-winning actors Hugh Jackman, Christian Bale, Michael Caine and Scarlett Johansson star in THE PRESTIGE, the twisting, turning story that, like all great magic tricks, stays with you. Two young, passionate magicians, Robert Angier (Jackman), a charismatic showman, and Alfred Borden (Bale), a gifted illusionist, are friends and partners until one fateful night when their biggest trick goes terribly wrong.  Now the bitterest of enemies, they will stop at nothing to learn each other's secrets. As their rivalry escalates into a total obsession full of deceit and sabotage, they risk everything to become the greatest magician of all time. But nothing is as it seems, so watch closely.  And be prepared to watch it again and again.",
            "publish_date": "2007",
            "added": "2025-05-01"
        },
        {
            "title": "Twilight (Single-Disc Edition)",
            "creators": "Catherine Hardwicke",
            "ean_isbn13": "25192080746",
            "upc_isbn10": "025192080746",
            "description": "Bella Swan (Stewart) doesn't expect much when she moves to the small town of Forks, Washington, until she meets the mysterious and handsome Edward Cullen (Pattinson) - a boy who's hiding a dark secret: he's a vampire. As their worlds and hearts collide, Edward must battle the bloodlust raging inside him as well as a coterie of undead that would make Bella their prey. Based on the #1 New York Times best-selling sensation by Stephenie Meyer, Twilight adds a dangerous twist to the classic story of star-crossed lovers.",
            "publish_date": "2010",
            "added": "2025-05-01"
        },
        {
            "title": "The Twilight Saga: Eclipse",
            "creators": "David Slade",
            "ean_isbn13": "25192083266",
            "upc_isbn10": "025192083266",
            "description": "It all begins: with a choice. In the third chapter of Stephenie Meyer's phenomenal Twilight saga, Bella Swan is surrounded by danger as Seattle is hit by a string of murders and an evil vampire continues her quest for revenge. In the midst of it all, Bella is forced to choose between her love, Edward Cullen, and her friend, Jacob Blackknowing that her decision may ignite the ageless struggle between vampire and werewolf. DVD/BD Special Features (2-Disc &amp; BD/DVD Combo Disc only) 2 Audio Commentaries: Rob Pattinson &amp; Kristen Stewart; Stephenie Meyer Deleted and Extended Scenes Photo Gallery 6-Part Making of Documentary Jump to... Your favorite scenes Music Videos PIP Commentary (BD only)",
            "publish_date": "2010",
            "added": "2025-05-01"
        },
        {
            "title": "The Twilight Saga: New Moon",
            "creators": "Chris Weitz",
            "ean_isbn13": "25192058158",
            "upc_isbn10": "025192058158",
            "description": "TWILIGHT is an action-packed, modern day love story between a vampire and a human. Bella Swan (Kristen Stewart) has always been a little bit different, never caring about fitting in with the trendy girls at her Phoenix high school. When her mother remarries and sends Bella to live with her father in the rainy little town of Forks, Washington, she doesn't expect much of anything to change. Then she meets the mysterious and dazzlingly beautiful Edward Cullen (Robert Pattinson), a boy unlike any she's ever met. Intelligent and witty, he sees straight into her soul. Soon, Bella and Edward are swept up in a passionate and decidedly unorthodox romance. Edward can run faster than a mountain lion, he can stop a moving car with his bare hands and he hasn't aged since 1918. Like all vampires, he's immortal. But he doesn't have fangs, and he doesn't drink human blood; Edward and his family are unique among vampires in their lifestyle choice. To Edward, Bella is that thing he has waited 90 years for a soul mate. But the closer they get, the more Edward must struggle to resist the primal pull of her scent, which could send him into an uncontrollable frenzy. But what will Edward &amp; Bella do when James (Cam Gigandet), Laurent (Edi Gathegi) and Victoria (Rachelle Lefevre), the Cullens' mortal vampire enemies, come to town, looking for her?",
            "publish_date": "2010",
            "added": "2025-05-01"
        },
        {
            "title": "The Twilight Saga: Breaking Dawn - Part 1 (Two-Disc Special Edition)",
            "creators": "Bill Condon",
            "ean_isbn13": "25192134548",
            "upc_isbn10": "025192134548",
            "description": "In the highly anticipated fourth installment of The Twilight Saga, a marriage, honeymoon and the birth of a child bring unforeseen and shocking developments for Bella (Kristen Stewart) and Edward (Robert Pattinson) and those they love, including new complications with werewolf Jacob Black (Taylor Lautner). Special Features:  Go behind the scenes with a captivating 6-PART MAKING-OF DOCUMENTARY; relive the memories with Edward &amp; Bella's personal WEDDING VIDEO; get a glimpse into JACOB'S DESTINY; watch your favorite scenes over and over in EDWARD FAST FORWARD and JACOB FAST FORWARD; plus an AUDIO COMMENTARY with Director Bill Condon",
            "publish_date": "2012",
            "added": "2025-05-01"
        },
        {
            "title": "Elf (Infinifilm Edition)",
            "creators": "Jon Favreau",
            "ean_isbn13": "9780780647749",
            "upc_isbn10": "794043716829",
            "description": "This hilarious Christmas film tells the tale of a young orphan child who mistakenly crawls into Santa's bag of gifts on Christmas Eve and is transported back to the North Pole and raised as an elf. Years later Buddy learns he is not really an elf and goes on a journey to New York City to find his true identity. DVD Features:Audio Commentary:2 commentaries with Will Ferrell &amp; DirectorDVD ROM FeaturesDeleted ScenesFeaturette:Film school for kids Tag along with Will Ferrell How they made the North Pole Kids on Christmas and more!",
            "publish_date": "2006",
            "added": "2025-05-01"
        },
        {
            "title": "Assassin's Creed",
            "creators": "",
            "ean_isbn13": "24543102120",
            "upc_isbn10": "024543102120",
            "description": "",
            "publish_date": "2017",
            "added": "2025-05-01"
        },
        {
            "title": "Warm Bodies",
            "creators": "Jonathan Levine",
            "ean_isbn13": "25192190636",
            "upc_isbn10": "025192190636",
            "description": "After a zombie epidemic, R (a zombie) rescues Julie (a human survivor) from a zombie attack. The two form a special relationship in their struggle for survival, R becomes increasingly more human - setting off a chain of events that begins to transform the other zombies and maybe even the whole lifeless world.",
            "publish_date": "2013",
            "added": "2025-05-01"
        },
        {
            "title": "Spy Kids",
            "creators": "Robert Rodriguez",
            "ean_isbn13": "9780788830525",
            "upc_isbn10": "786936161557",
            "description": "Genre: Family  Stars Antonio Banderas, Carla Gugino, Alexa Vega and Daryl Sabara.  Written and directed by Robert Rodriguez.     DVD features:    - Theatrical trailer  - Theatrical teasers       ©2002 Disney Enterprise Inc.",
            "publish_date": "2001",
            "added": "2025-05-01"
        },
        {
            "title": "Speed Racer - Episodes 1-11",
            "creators": "",
            "ean_isbn13": "12236116509",
            "upc_isbn10": "012236116509",
            "description": "The world&#039;s favorite high-octane animated hero is back!   Roaring into action aboard his trusty Mach-5, it&#039;s the intrepid young  race car driver who sparked an international cult phenomenon: the one  and only SPEED RACER! Now, for the first time ever, the first 11 episodes of this classic  hugely popular &quot;Japanimation&quot; series are brought together in this  special limited edition DVD.  Turbo-charged with all of Speed Racer&#039;s  trademark animated thrills, offbeat humor, unforgettable characters and  cliff-hanger racing action, these collectible, specially remastered  episodes are the stuff of every fan&#039;s dreams.  So fasten your seatbelts  - and join Speed, girlfriend Trixie, Speed&#039;s two brothers, one  mischievous monkey, and an outrageous assortment of villains for one  fast-lane, no-brakes, nonstop adventure after another!   Ready...Set...Go, Speed Racer, Go!",
            "publish_date": "2003",
            "added": "2025-05-01"
        },
        {
            "title": "Gladiator Signature Selection (Two-Disc Collector's Edition)",
            "creators": "Ridley Scott",
            "ean_isbn13": "9780783252223",
            "upc_isbn10": "667068720426",
            "description": "A man robbed of his name and his dignity strives to win them back, and gain the freedom of his people, in this epic historical drama from director Ridley Scott. In the year 180, the death of emperor Marcus Aurelius (Richard Harris) throws the Roman Empire into chaos. Maximus (Russell Crowe) is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus (Joaquin Phoenix) ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences. His battle skills serve him well, and he becomes one of the most famous and admired men to fight in the Colosseum. Determined to avenge himself against the man who took away his freedom and laid waste to his family, Maximus believes that he can use his fame and skill in the ring to avenge the loss of his family and former glory. As the gladiator begins to challenge his rule, Commodus decides to put his own fighting mettle to the test by squaring off with Maximus in a battle to the death. Gladiator also features Derek Jacobi, Connie Nielsen, Djimon Hounsou, and Oliver Reed, who died of a heart attack midway through production.",
            "publish_date": "2000",
            "added": "2025-05-01"
        },
        {
            "title": "The Da Vinci Code (Full Screen Two-Disc Special Edition)",
            "creators": "Ron Howard",
            "ean_isbn13": "43396150362",
            "upc_isbn10": "043396150362",
            "description": "Dan Brown's international bestseller comes alive in the film  The Da Vinci Code, directed by Ron Howard with a screenplay by  Akiva Goldsman. Join symbologist Robert Langdon (Academy Award® winner Tom Hanks, 1993 Best Actor, Philadelphia, and 1994 Best Actor,   Forrest Gump) and cryptologist Sophie Neveu (Audrey Tautou) in their heart-racing quest to solve a bizarre murder mystery that will take them from France to England - and behind the veil of a mysterious ancient society, where they discover a secret protected since the time of Christ. With first-rate performances by Sir Ian McKellen, Alfred Molina and Jean Reno, critics are calling  The Da Vinci Code \"involving\"* and \"intriguing,\"* \"a first rate thriller.\"**",
            "publish_date": "2006",
            "added": "2025-05-01"
        },
        {
            "title": "Ocean's Eleven",
            "creators": "Steven Soderbergh",
            "ean_isbn13": "85392263424",
            "upc_isbn10": "085392263424",
            "description": "",
            "publish_date": "2002",
            "added": "2025-05-01"
        },
        {
            "title": "The Matrix Revolutions (Two-Disc Widescreen Edition)",
            "creators": "Andy Wachowski, Larry Wachowski",
            "ean_isbn13": "9780790790305",
            "upc_isbn10": "085393320928",
            "description": "Matrix Revolutions, The (Dbl DVD) (WS)",
            "publish_date": "2010",
            "added": "2025-05-01"
        },
        {
            "title": "The Matrix",
            "creators": "Andy Wachowski, Lana Wachowski",
            "ean_isbn13": "9780790742618",
            "upc_isbn10": "085391773726",
            "description": "Set in the 22nd century, The Matrix tells of a computer hacker (Reeves) who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth. The computers are powered by human beings...",
            "publish_date": "1999",
            "added": "2025-05-01"
        },
        {
            "title": "The Matrix Reloaded (Full Screen Edition)",
            "creators": "Andy Wachowski, Lana Wachowski",
            "ean_isbn13": "9780790764016",
            "upc_isbn10": "085392185122",
            "description": "In the second chapter of the Matrix trilogy, Neo (Keanu Reeves), Trinity (Carrie-Anne Moss) and Morpheus (Laurence Fishburne) continue to lead the revolt against the Machine Army. In their quest to save the human race from extinction, they gain greater insight into the construct of The Matrix and Neo&#039;s pivotal role in the fate of mankind.DVD Features:DVD ROM Features:Web links to the official Matrix websiteDocumentaries:PRELOAD: Go behind the scenes with the cast and crew THE FREEWAY CHASE: Anatomy of the mind-blowing scene ENTER THE MATRIX: Making of the ground-breaking video game WHAT IS THE ANIMATRIX? THE MATRIX UNFOLDS: A look at the Matrix phenomenon GET ME AN EXIT: Matrix-inspired design advertising Other:THE MTV MOVIE AWARDS RELOADED",
            "publish_date": "2003",
            "added": "2025-05-01"
        },
        {
            "title": "Lord of the Rings: The Motion Picture Trilogy",
            "creators": "Various",
            "ean_isbn13": "794043159114",
            "upc_isbn10": "794043159114",
            "description": "",
            "publish_date": "2014",
            "added": "2025-05-01"
        },
        {
            "title": "Men in Black (Collector's Series) - DTS",
            "creators": "Barry Sonnenfeld",
            "ean_isbn13": "9780767855853",
            "upc_isbn10": "043396054981",
            "description": "This imaginative summer comedy from director Barry Sonnenfeld (Get Shorty) is a lot of fun, largely on the strength of Will Smith&#039;s engaging performance as the rookie partner of a secret agent (Tommy Lee Jones) assigned to keep tabs on Earth-dwelling extraterrestrials. There&#039;s lots of comedy to spare in this bright film, some of the funniest stuff found in the margins of the major action. (A scene with Smith&#039;s character being trounced in the distance by a huge alien while Jones questions a witness is a riot.) The inventiveness never lets up, and the cast--including Vincent D&#039;Onofrio doing frighteningly convincing work as an alien occupying a decaying human--hold up their end splendidly. --Tom Keogh",
            "publish_date": "2000",
            "added": "2025-05-01"
        },
        {
            "title": "Perfect Days (The Criterion Collection) [Blu-ray]",
            "creators": "",
            "ean_isbn13": "0715515299411",
            "upc_isbn10": "715515299411",
            "description": "",
            "publish_date": "2024",
            "added": "2025-05-01"
        },
        {
            "title": "Percy Jackson & the Olympians: The Lightning Thief [Blu-ray]",
            "creators": "Chris Columbus",
            "ean_isbn13": "24543669111",
            "upc_isbn10": "024543669111",
            "description": "Modern and mythical worlds collide in this thunderous fantasy-adventure starring Pierce Brosnan, Kevin McKidd and Uma Thurman as you’ve never seen them before! Percy Jackson is no ordinary teenager...he’s just learned he’s the son of Poseidon and is accused of stealing Zeus’ ­lightning bolt – the most powerful weapon ever created! With storm clouds brewing, Percy embarks on an incredible cross-country journey to prove his innocence, recover the bolt and prevent a war amongst the gods that could destroy our world!",
            "publish_date": "2010",
            "added": "2025-05-01"
        },
        {
            "title": "The Martian [Blu-ray]",
            "creators": "Ridley Scott",
            "ean_isbn13": "24543206507",
            "upc_isbn10": "024543206507",
            "description": "During a manned mission to Mars, Astronaut Mark Watney (Matt Damon) is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive. Millions of miles away, NASA and a team of international scientists work tirelessly to bring \"the Martian\" home, while his crewmates concurrently plot a daring, if not impossible rescue mission. As these stories of incredible bravery unfold, the world comes together to root for Watney's safe return.",
            "publish_date": "",
            "added": "2025-05-01"
        },
        {
            "title": "National Treasure (Full Screen Edition)",
            "creators": "Jon Turteltaub",
            "ean_isbn13": "786936242911",
            "upc_isbn10": "786936242911",
            "description": "From Jerry Bruckheimer, producer of PIRATES OF THE CARIBBEAN, and Jon Turteltaub, director of PHENOMENON, comes NATIONAL TREASURE. It&#039;s the thrilling, edge-of-your-seat adventure starring Academy Award&reg; winner Nicolas Cage (1995 Best Actor, LEAVING LAS VEGAS) as Benjamin Franklin Gates. Ever since he was a boy, Gates has been obsessed with finding the legendary Knights Templar Treasure, the greatest fortune known to man. As Gates tries to find and decipher ancient riddles that will lead him to it, he&#039;s dogged by a ruthless enemy (Sean Bean, THE LORD OF THE RINGS trilogy) who wants the riches for himself. Now in a race against time, Gates must steal one of America&#039;s most sacred and guarded documents -- the Declaration of Independence -- or let it, and a key clue to the mystery, fall into dangerous hands. Heart-pounding chases, close calls, and the FBI turn Gates&#039;s quest into a high-stakes crime caper and the most exciting treasure hunt you&#039;ve ever experienced.",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Monsters, Inc. (Two-Disc Collector's Edition)",
            "creators": "David Silverman, Lee Unkrich, Pete Docter, Ralph Eggleston, Roger Gould",
            "ean_isbn13": "9780788833687",
            "upc_isbn10": "786936164886",
            "description": "From the Academy Award(R)-winning creators of TOY STORY (2001, Best Animated Short Film, \"For the Birds\") comes the computer-animated film that captured the hearts of fans and critics everywhere. MONSTERS, INC., is \"visually dazzling, action-packed, and hilarious\" (Boston Herald), featuring groundbreaking animation, imaginative storytelling, and unforgettable voice talent. John Goodman stars as the lovable James P. Sullivan (Sulley) and Billy Crystal as his wisecracking best friend, Mike Wazowski. Top scarer Sulley and his enthusiastic Scare Assistant Mike work at Monsters, Inc., the largest scream-processing factory in Monstropolis. The main power source of the monster world is the collected screams of human children. Monsters believe children are dangerous and toxic, however, and they are scared silly when a little girl wanders into their world. Sulley and Mike do their best to return the girl home, but they face monstrous intrigue and some hilarious misadventures along the way. MONSTERS, INC., is \"supremely clever -- fun for kids and adults alike\" (CBS-TV). Treat yourself to the most entertaining movie of the year with all-new exclusive bonus features and animation for monster laughs and monster fun.Product Measures: 0.61\" x 5.34\" x 7.5\"",
            "publish_date": "2002",
            "added": "2025-05-01"
        },
        {
            "title": "Madagascar (Full Screen Edition)",
            "creators": "Tom McGrath, Eric Darnell",
            "ean_isbn13": "9781417073580",
            "upc_isbn10": "678149456929",
            "description": "Taking the kid-friendly concept to a new level, DreamWorks' DVD release of Madagascar features more than 100 interactive games and creative activities. DVD extras for the zoo-breakout cartoon include a virtual tour of Madagascar, a montage of technical goofs and various behind-the-scenes features and documentaries. But the real highlight is a menu option that takes kids to a virtual playground in which they can play various games, learn to draw the film's characters, play a new version of \"Whack-A-Mole\" and print iron-ons, download photo frames and create personalized invitations, decorations and posters.",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Ratatouille",
            "creators": "Brad Bird, Jan Pinkava",
            "ean_isbn13": "786936727173",
            "upc_isbn10": "786936727173",
            "description": "In one of Paris' finest restaurants, Remy, a determined young rat, aspires to become a renowned French Chef. With the help of his friend Linguini, they set off on a fun-filled adventure, setting in motion a hilarious chain of events that turns the City Of Lights upside-down.",
            "publish_date": "2007",
            "added": "2025-05-01"
        },
        {
            "title": "Get Smart (Single-Disc Full Screen Edition)",
            "creators": "",
            "ean_isbn13": "883929048861",
            "upc_isbn10": "883929048861",
            "description": "Steve Carell, Anne Hathaway, Dwayne &quot;The Rock&quot; Johnson, Terence Stamp, and Alan Arkin star in the big-screen update of the 60&#039;s spy spoof &quot;Get Smart.&quot;",
            "publish_date": "2008",
            "added": "2025-05-01"
        },
        {
            "title": "School of Rock (Widescreen Edition)",
            "creators": "Richard Linklater",
            "ean_isbn13": "9780792190981",
            "upc_isbn10": "097363385141",
            "description": "After his band fires him, a musician takes a job as a 4th grade substitute teacher at a prestigious school. Not knowing much about teaching, the musician decides to tap into the musical knowledge of his young proteges and create a band.",
            "publish_date": "2004",
            "added": "2025-05-01"
        },
        {
            "title": "The Bourne Identity (Widescreen Collector's Edition)",
            "creators": "Doug Liman",
            "ean_isbn13": "9780783263595",
            "upc_isbn10": "025192155123",
            "description": "\"A new action hero is Bourne!\" (Access Hollywood) Get ready for the explosive, action-packed hit with incredible fight sequences starring Academy Award winner Matt Damon (Ocean's Eleven). Pulled from the sea with two bullets in his back, Jason Bourne discovers he has the skills of a very dangerous man and no memory of his violent past. Racing to unlock the secret of his own identity, he discovers the deadly truth: he's an elite government agent. But to the government, Jason Bourne isn't just their property, he's a malfunctioning thirty million dollar weapon. Lethally trained, built to disappear, he's an agent on the run who has to be taken out. Now, the government's top operative has become its number one target, in a super-charged, thrill-a-minute spectacular loaded with \"Non-stop action!\" (Bill Zwecker, FOX-TV).",
            "publish_date": "2003",
            "added": "2025-05-01"
        },
        {
            "title": "Good Will Hunting",
            "creators": "",
            "ean_isbn13": "31398134602",
            "upc_isbn10": "031398134602",
            "description": "A true motion picture phenomenon, this triumphant story was nominated for 9 Academy Awards(R) -- winning Oscars for Robin Williams (Best Supporting Actor) and hot newcomers Matt Damon and Ben Affleck (Best Original Screenplay). The most brilliant mind at America's top university isn't a student ... he's the kid who cleans the floors! Will Hunting (Damon) is a headstrong, working-class genius who's failing the lessons of life. After one too many run-ins with the law, Will's last chance is a psychology professor (Williams), who might be the only man who can reach him! With acclaimed performances from Academy Award(R)-nominee Minnie Driver (GROSSE POINTE BLANK) and Ben Affleck (ARMAGEDDON) -- you'll find GOOD WILL HUNTING a powerful and unforgettable movie experience!",
            "publish_date": "2011",
            "added": "2025-05-01"
        },
        {
            "title": "Big Hero 6 DVD",
            "creators": "Chris Williams Don Hall",
            "ean_isbn13": "786936844856",
            "upc_isbn10": "786936844856",
            "description": "With all the heart and humor audiences expect from Walt Disney Animation Studios, BIG HERO 6 is an action-packed comedy adventure that introduces Baymax, a lovable, personal companion robot, who forms a special bond with robotics prodigy Hiro Hamada. When a devastating turn of events catapults them into the midst of a dangerous plot unfolding in the streets of San Fransokyo, Hiro turns to Baymax and his diverse group of friends -- adrenaline junky Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred -- who transform into a band of unlikely heroes. Bring home Disney&#039;s BIG HERO 6, featuring comic-book-style action and hilarious, unforgettable characters -- it&#039;s fun for the whole family!",
            "publish_date": "2015",
            "added": "2025-05-01"
        },
        {
            "title": "Kronk's New Groove",
            "creators": "Elliot M. Bour & Saul Andrew Blinkoff",
            "ean_isbn13": "9780788854651",
            "upc_isbn10": "786936242744",
            "description": "Get back in the groove with Disney's hilarious all-new movie.  After his wild adventures with Pacha and Emperor Kuzco, lovable lug Kronk, Yzma's former henchman, has happily started a new life as the head chef in his very own diner.  An all-new wacky adventure begins, however, when a llama-gram arrives telling him that his father is due for a visit. Before you can say \"squeaker, squeak,\" Kronk is cooking up trouble with the sly enchantress Yzma, trying to make himself look like a success in time for Papi's arrival.  After a bunch of big blunders and a massive cheese explosion in the restaurant, Kronk finds himself covered in a heap of trouble.  It is only with the help of friends both old and new that Kronk learns to be true to his groove.~",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Sky High",
            "creators": "Mike Mitchell",
            "ean_isbn13": "786936288353",
            "upc_isbn10": "786936288353",
            "description": "A super adventure of heroic proportions, this crowd-pleasing hit from Walt Disney Pictures stars Hollywood favorites Kurt Russell and Kelly Preston! The son of legendary heroes Commander (Russell) and Jetstream (Preston), young Will Stronghold carries huge expectations as he enters a high-tech high school known for molding the heroes of tomorrow. With no apparent superpowers of his own, however, Will seems destined to grow up a mere sidekick. But as he discovers his true strengths, he'll also learn that it takes loyalty and teamwork to truly become a hero!",
            "publish_date": "2005",
            "added": "2025-05-01"
        },
        {
            "title": "Stitch! The Movie",
            "creators": "Tony Craig, Roberts Gannaway",
            "ean_isbn13": "786936211184",
            "upc_isbn10": "786936211184",
            "description": "Disney sets a record for bringing out a direct-to-video sequel after the initial film. Stitch: The Movie arrives only a year after the enjoyable Lilo &amp; Stitch played theaters and reunites the title character (otherwise known as Experiment 62",
            "publish_date": "2003",
            "added": "2025-05-01"
        },
        {
            "title": "Ice Age - Super Cool Edition",
            "creators": "Carlos Saldanha, Chris Wedge",
            "ean_isbn13": "24543229087",
            "upc_isbn10": "024543229087",
            "description": "They came... they thawed... they conquered the hearts of audiences everywhere in the coolest animated adventure of all time! Heading south to avoid the bad case of global frostbite, a group of migrating misfit creatures embark on a hilarious quest to reunite a human baby with his tribe. Featuring an all-star voice cast, including Ray Romano, John Leguizamo and Denis Leary, ICE AGE is &quot;a pure delight&quot; (New York Daily News) for all ages!",
            "publish_date": "2006",
            "added": "2025-05-01"
        },
        {
            "title": "Holes (Full Screen Edition)",
            "creators": "Andrew Davis",
            "ean_isbn13": "9780788848513",
            "upc_isbn10": "786936225495",
            "description": "The award-winning bestseller comes to life in this phenomenally fun, adventure-filled movie starring Emmy Award-winner Shia LaBeouf (Outstanding Performer In A Children's Series, Disney Channel's EVEN STEVENS, 2000). Dogged by bad luck stemming from an ancient family curse, young Stanley Yelnats (LaBeouf) is sent to Camp Green Lake, a very weird place that's not green and doesn't have a lake. Once there, he's thrown headlong into the adventure of his life when he and his colorful campmates -- Squid, Armpit, Zigzag, Magnet, X-Ray, and Zero -- must dig a hole a day to keep the warden at bay. But why? Through it all, Stanley and company must forge fast friendships as they try to unearth the mystery of what's really going on in the middle of nowhere. Filled with humor and heartwarming messages of friendship and teamwork, HOLES is a treasure everyone will dig.",
            "publish_date": "2003",
            "added": "2025-05-01"
        },
        {
            "title": "Happy Feet (Widescreen Edition)",
            "creators": "",
            "ean_isbn13": "85391120926",
            "upc_isbn10": "085391120926",
            "description": "Happy Feet (DVD) (WS)Except musically challenged Mumble (voiced by Elijah Wood--Lord of the Rings films). In frozen Antarctica, where penguins sing to woo a mate, Mumble's talent is dancing: When his fellow penguins start to croon, Mumble's feet want to move. Even worse, Gloria (voiced by Brittany Murphy), the object of Mumble's affection, only wants to hear a song from Mumble's heart. But when encroaching fishermen threaten the penguins, the colony is saved by Mumble's valor, and Gloria's heart is won by his dancing, Happy Feet. Directed by George Miller (Babe), choreographed by Tony winner Savion Glover and featuring the voices of Hugh Jackman, Nicole Kidman, Robin Williams and crocodile hunter Steve Irwin.]]&gt;",
            "publish_date": "2008",
            "added": "2025-05-01"
        },
        {
            "title": "The Goonies",
            "creators": "Richard Donner",
            "ean_isbn13": "9780790749808",
            "upc_isbn10": "085391147428",
            "description": "Following a mysterious treasure map into a spectacular underground realm of twisting passages, outrageous booby-traps and a long-lost pirate ship full of golden dubloons, the kids race to stay one step ahead of a family of bumbling bad guys... and a mild-mannered monster with a face only a mother could love.DVD Features:Audio CommentaryDeleted ScenesDocumentaryMusic VideoOuttakesTheatrical Trailer",
            "publish_date": "2001",
            "added": "2025-05-01"
        },
        {
            "title": "Where the Wild Things Are",
            "creators": "Spike Jonze",
            "ean_isbn13": "0085391189930",
            "upc_isbn10": "085391189930",
            "description": "",
            "publish_date": "2010",
            "added": "2025-05-07"
        },
        {
            "title": "Wayne's World",
            "creators": "",
            "ean_isbn13": "0097363270645",
            "upc_isbn10": "097363270645",
            "description": "",
            "publish_date": "2001",
            "added": "2025-05-07"
        },
        {
            "title": "The Bourne Supremacy (Widescreen Edition)",
            "creators": "Paul Greengrass",
            "ean_isbn13": "9781417003440",
            "upc_isbn10": "025192499326",
            "description": "They should have left him alone. Academy Award winner Matt Damon is back as expert assassin Jason Bourne in this stunning, non-stop action hit. Fuelled by awesome fight scenes and some of the most breathtaking chase sequences ever filmed, it's a state-of-the-art espionage thriller that explodes into action and never lets up!",
            "publish_date": "2004",
            "added": "2025-05-07"
        },
        {
            "title": "The Bourne Ultimatum (Widescreen Edition)",
            "creators": "Paul Greengrass",
            "ean_isbn13": "0025193227423",
            "upc_isbn10": "025193227423",
            "description": "",
            "publish_date": "2007",
            "added": "2025-05-07"
        }
    ]
}